benchmarks/gpt-oss-cpu/results/p6/TP4/mtbench_c32.log
/home/sysadmin/pramod/bench/.venv/bin/vllm bench serve --backend vllm --model gpt-oss-20b --tokenizer /home/sysadmin/pramod/bench/models/gpt-oss-20b --port 8100 --seed 0 --disable-tqdm --save-result --result-dir /home/sysadmin/pramod/bench/results/p6/TP4 --result-filename mtbench_c32.json --percentile-metrics ttft,tpot,itl,e2el --metric-percentiles 50,90,99 --backend openai-chat --endpoint /v1/chat/completions --skip-chat-template --temperature 0 --dataset-name hf --dataset-path philschmid/mt-bench --hf-split train --hf-output-len 2048 --save-detailed --max-concurrency 32 --num-prompts 80 --metadata config=TP4 workload=mtbench serve_extra=
WARNING 09-25 10:43:28 [importing.py:45] Triton is installed, but doesn't include CPU backend. Disabling Triton.
INFO 09-25 10:43:28 [importing.py:74] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-25 10:43:28 [importing.py:98] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 09-25 10:43:29 [argparse_utils.py:441] Found duplicate keys --backend
Using the latest cached version of the dataset since philschmid/mt-bench couldn't be found on the Hugging Face Hub (offline mode is enabled).
Found the latest cached dataset configuration 'default' at /home/sysadmin/.cache/huggingface/datasets/philschmid___mt-bench/default/0.0.0/bd19d60b9afe5201563a1008f58959322187d924 (last modified on Thu Sep 24 09:35:34 2026).
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x74acbc7f8900>, trust_remote_code=False, seed=0, num_prompts=80, dataset_name='hf', no_stream=False, dataset_path='philschmid/mt-bench', no_oversample=False, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split='train', hf_name=None, hf_output_len=2048, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/chat/completions', header=None, max_concurrency=32, model='gpt-oss-20b', input_len=None, output_len=None, tokenizer='/home/sysadmin/pramod/bench/models/gpt-oss-20b', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['config=TP4', 'workload=mtbench', 'serve_extra='], result_dir='/home/sysadmin/pramod/bench/results/p6/TP4', result_filename='mtbench_c32.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-60c9990e-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     80        
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  120.75    
Total input tokens:                      10553     
Total generated tokens:                  92867     
Request throughput (req/s):              0.66      
Output token throughput (tok/s):         769.06    
Peak output token throughput (tok/s):    998.00    
Peak concurrent requests:                41.00     
Total token throughput (tok/s):          856.45    
---------------Time to First Token----------------
Mean TTFT (ms):                          307.27    
Median TTFT (ms):                        111.33    
P50 TTFT (ms):                           111.33    
P90 TTFT (ms):                           615.13    
P99 TTFT (ms):                           665.52    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          33.26     
Median TPOT (ms):                        33.99     
P50 TPOT (ms):                           33.99     
P90 TPOT (ms):                           34.54     
P99 TPOT (ms):                           35.52     
---------------Inter-token Latency----------------
Mean ITL (ms):                           33.31     
Median ITL (ms):                         33.49     
P50 ITL (ms):                            33.49     
P90 ITL (ms):                            36.03     
P99 ITL (ms):                            56.06     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          38681.46  
Median E2EL (ms):                        39745.36  
P50 E2EL (ms):                           39745.36  
P90 E2EL (ms):                           70655.09  
P99 E2EL (ms):                           70764.28  
==================================================